RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_lobs_regs.h
/*
 * NUM1 (RW)
 *
 * Select sample signal bit number1 in second group
 */
#define LOBS_SIGSELA2_NUM1_MASK (0xFFU)
#define LOBS_SIGSELA2_NUM1_SHIFT (0U)
#define LOBS_SIGSELA2_NUM1_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM1_SHIFT) & LOBS_SIGSELA2_NUM1_MASK)
#define LOBS_SIGSELA2_NUM1_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM1_MASK) >> LOBS_SIGSELA2_NUM1_SHIFT)

/* Bitfield definition for register: SIGENA */
/*
 * EN2 (RW)
 *
 * Enable sample signal number2
 */
#define LOBS_SIGENA_EN2_MASK (0xF0U)
#define LOBS_SIGENA_EN2_SHIFT (4U)
#define LOBS_SIGENA_EN2_SET(x) (((uint32_t)(x) << LOBS_SIGENA_EN2_SHIFT) & LOBS_SIGENA_EN2_MASK)
#define LOBS_SIGENA_EN2_GET(x) (((uint32_t)(x) & LOBS_SIGENA_EN2_MASK) >> LOBS_SIGENA_EN2_SHIFT)

/*
 * EN1 (RW)
 *
 * Enable sample signal number1
 */
#define LOBS_SIGENA_EN1_MASK (0xFU)
#define LOBS_SIGENA_EN1_SHIFT (0U)
#define LOBS_SIGENA_EN1_SET(x) (((uint32_t)(x) << LOBS_SIGENA_EN1_SHIFT) & LOBS_SIGENA_EN1_MASK)
#define LOBS_SIGENA_EN1_GET(x) (((uint32_t)(x) & LOBS_SIGENA_EN1_MASK) >> LOBS_SIGENA_EN1_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGSEL */
/*
 * EN (RW)
 *
 * Selects Signal Group.
 * 0x1 Selects Signal Group 0.
 * 0x2 Selects Signal Group 1.
 * 0x4 Selects Signal Group 2.
 * 0x8 Selects Signal Group 3.
 * 0x10 Selects Signal Group 4.
 * 0x20 Selects Signal Group 5.
 * 0x40 Selects Signal Group 6.
 * 0x80 Selects Signal Group 7.
 * 0x100 Selects Signal Group 8.
 * 0x200 Selects Signal Group 9.
 * 0x400 Selects Signal Group 10.
 * 0x800 Selects Signal Group 11.
 */
#define LOBS_STATE_SIGSEL_EN_MASK (0xFFFU)
#define LOBS_STATE_SIGSEL_EN_SHIFT (0U)
#define LOBS_STATE_SIGSEL_EN_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGSEL_EN_SHIFT) & LOBS_STATE_SIGSEL_EN_MASK)
#define LOBS_STATE_SIGSEL_EN_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGSEL_EN_MASK) >> LOBS_STATE_SIGSEL_EN_SHIFT)

/* Bitfield definition for register of struct array STATE: TRIGCTRL */
/*
 * TRACE (RW)
 *
 * Trace capture control.
 * 0b10 Trace is captured every ELACLK cycle.
 * others Reserved.
 */
#define LOBS_STATE_TRIGCTRL_TRACE_MASK (0xC0U)
#define LOBS_STATE_TRIGCTRL_TRACE_SHIFT (6U)
#define LOBS_STATE_TRIGCTRL_TRACE_SET(x) (((uint32_t)(x) << LOBS_STATE_TRIGCTRL_TRACE_SHIFT) & LOBS_STATE_TRIGCTRL_TRACE_MASK)
#define LOBS_STATE_TRIGCTRL_TRACE_GET(x) (((uint32_t)(x) & LOBS_STATE_TRIGCTRL_TRACE_MASK) >> LOBS_STATE_TRIGCTRL_TRACE_SHIFT)

/*
 * COMPSEL (RW)
 *
 * Comparison mode. Acts as both a counter enable and a select for the comparison mode.
 * 0b0 Disable counters and select Trigger Signal Comparison mode.
 * 0b1 Enable counters and select Trigger Counter Comparison mode.
 */
#define LOBS_STATE_TRIGCTRL_COMPSEL_MASK (0x8U)
#define LOBS_STATE_TRIGCTRL_COMPSEL_SHIFT (3U)
#define LOBS_STATE_TRIGCTRL_COMPSEL_SET(x) (((uint32_t)(x) << LOBS_STATE_TRIGCTRL_COMPSEL_SHIFT) & LOBS_STATE_TRIGCTRL_COMPSEL_MASK)
#define LOBS_STATE_TRIGCTRL_COMPSEL_GET(x) (((uint32_t)(x) & LOBS_STATE_TRIGCTRL_COMPSEL_MASK) >> LOBS_STATE_TRIGCTRL_COMPSEL_SHIFT)

/*
 * COMP (RW)
 *
 * Trigger Signal Comparison type select.
 * 0b000 Trigger Signal Comparisons disabled. The enabled counters count clocks immediately after the Trigger State has been entered and generate a programmable Output Action and transition to the next Trigger State when the Counter Compare Register count is reached, that is when a Trigger Counter Comparison match occurs.
 * 0b001 Compare type is equal (==).
 * 0b010 Compare type is greater than (>).
 * 0b011 Compare type is greater than or equal (>=).
 * 0b101 Compare type is not equal (!=).
 * 0b110 Compare type is less than (<).
 * 0b111 Compare type is less than or equal (<=).
 */
#define LOBS_STATE_TRIGCTRL_COMP_MASK (0x7U)
#define LOBS_STATE_TRIGCTRL_COMP_SHIFT (0U)
#define LOBS_STATE_TRIGCTRL_COMP_SET(x) (((uint32_t)(x) << LOBS_STATE_TRIGCTRL_COMP_SHIFT) & LOBS_STATE_TRIGCTRL_COMP_MASK)
#define LOBS_STATE_TRIGCTRL_COMP_GET(x) (((uint32_t)(x) & LOBS_STATE_TRIGCTRL_COMP_MASK) >> LOBS_STATE_TRIGCTRL_COMP_SHIFT)

/* Bitfield definition for register of struct array STATE: NEXTSTATE */
/*
 * NEXTSTATE (RW)
 *
 * Selects the next state to move to after the Trigger Condition has been met in the current state.
 * 0x0 Do not change state. This is the final Trigger State.
 * 0x1 Selects Trigger State 0.
 * 0x2 Selects Trigger State 1.
 * 0x4 Selects Trigger State 2.
 * 0x8 Selects Trigger State 3.
 * 0x10 Selects Trigger State 4.
 */
#define LOBS_STATE_NEXTSTATE_NEXTSTATE_MASK (0x1FU)
#define LOBS_STATE_NEXTSTATE_NEXTSTATE_SHIFT (0U)
#define LOBS_STATE_NEXTSTATE_NEXTSTATE_SET(x) (((uint32_t)(x) << LOBS_STATE_NEXTSTATE_NEXTSTATE_SHIFT) & LOBS_STATE_NEXTSTATE_NEXTSTATE_MASK)
#define LOBS_STATE_NEXTSTATE_NEXTSTATE_GET(x) (((uint32_t)(x) & LOBS_STATE_NEXTSTATE_NEXTSTATE_MASK) >> LOBS_STATE_NEXTSTATE_NEXTSTATE_SHIFT)

/* Bitfield definition for register of struct array STATE: ACTION */
/*
 * TRACE (RW)
 *
 * Trace active.
 * 0b0 Trace disable.
 * 0b1 Trace enable.
 */
#define LOBS_STATE_ACTION_TRACE_MASK (0x8U)
#define LOBS_STATE_ACTION_TRACE_SHIFT (3U)
#define LOBS_STATE_ACTION_TRACE_SET(x) (((uint32_t)(x) << LOBS_STATE_ACTION_TRACE_SHIFT) & LOBS_STATE_ACTION_TRACE_MASK)
#define LOBS_STATE_ACTION_TRACE_GET(x) (((uint32_t)(x) & LOBS_STATE_ACTION_TRACE_MASK) >> LOBS_STATE_ACTION_TRACE_SHIFT)

/* Bitfield definition for register of struct array STATE: COUNTCOMP */
/*
 * VALUE (RW)
 *
 * A value that, when reached in the associated up-counter for this Trigger State, causes a Trigger Counter Comparison match to occur.
 */
#define LOBS_STATE_COUNTCOMP_VALUE_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_COUNTCOMP_VALUE_SHIFT (0U)
#define LOBS_STATE_COUNTCOMP_VALUE_SET(x) (((uint32_t)(x) << LOBS_STATE_COUNTCOMP_VALUE_SHIFT) & LOBS_STATE_COUNTCOMP_VALUE_MASK)
#define LOBS_STATE_COUNTCOMP_VALUE_GET(x) (((uint32_t)(x) & LOBS_STATE_COUNTCOMP_VALUE_MASK) >> LOBS_STATE_COUNTCOMP_VALUE_SHIFT)

/* Bitfield definition for register of struct array STATE: EXTMASK */
/*
 * VALUE (RW)
 *
 * External Mask
 */
#define LOBS_STATE_EXTMASK_VALUE_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_EXTMASK_VALUE_SHIFT (0U)
#define LOBS_STATE_EXTMASK_VALUE_SET(x) (((uint32_t)(x) << LOBS_STATE_EXTMASK_VALUE_SHIFT) & LOBS_STATE_EXTMASK_VALUE_MASK)
#define LOBS_STATE_EXTMASK_VALUE_GET(x) (((uint32_t)(x) & LOBS_STATE_EXTMASK_VALUE_MASK) >> LOBS_STATE_EXTMASK_VALUE_SHIFT)

/* Bitfield definition for register of struct array STATE: EXTCOMP */
/*
 * VALUE (RW)
 *
 * External Compare
 */
#define LOBS_STATE_EXTCOMP_VALUE_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_EXTCOMP_VALUE_SHIFT (0U)
#define LOBS_STATE_EXTCOMP_VALUE_SET(x) (((uint32_t)(x) << LOBS_STATE_EXTCOMP_VALUE_SHIFT) & LOBS_STATE_EXTCOMP_VALUE_MASK)
#define LOBS_STATE_EXTCOMP_VALUE_GET(x) (((uint32_t)(x) & LOBS_STATE_EXTCOMP_VALUE_MASK) >> LOBS_STATE_EXTCOMP_VALUE_SHIFT)

